In [11]:
import pandas as pd

In [12]:
df = pd.read_csv(r"C:\Users\HP\Desktop\TE_codes\prac.csv")

In [13]:
df

   id    name class  marks
0   1   sahil    te   12.0
1   2   rohan    te   13.0
2   3  sanket    se   14.0
3   4   omkar   3rd    NaN
4   5   vinit    fe   15.0
5   6    yash    be   16.0
6   7  aniket   5th    NaN
7   8  aditya   7th   18.0

In [14]:
df.isnull()

      id   name  class  marks
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False   True
4  False  False  False  False
5  False  False  False  False
6  False  False  False   True
7  False  False  False  False

In [15]:
# Number of null values in every attribute
df.isnull().sum()

id       0
name     0
class    0
marks    2
dtype: int64

In [16]:
# How to remove null values
avg = df['marks'].mean()

In [17]:
avg

14.666666666666666

In [18]:
df = df.fillna(avg)

In [19]:
df

   id    name class      marks
0   1   sahil    te  12.000000
1   2   rohan    te  13.000000
2   3  sanket    se  14.000000
3   4   omkar   3rd  14.666667
4   5   vinit    fe  15.000000
5   6    yash    be  16.000000
6   7  aniket   5th  14.666667
7   8  aditya   7th  18.000000

In [20]:
# Identifying outliers
import numpy as np

In [21]:
sorted1 = sorted(df['marks'])

In [22]:
Q1 = np.percentile(sorted1,25)

In [23]:
Q1

13.75

In [24]:
Q3 = np.percentile(sorted1,75)

In [25]:
Q3

15.25

In [26]:
IQR = Q3 - Q1
IQR

1.5

In [27]:
LB = Q1 - (1.5*IQR)
LB

11.5

In [28]:
UB = Q3 + (1.5*IQR)
UB

17.5

In [29]:
outliers = []
for i in sorted1:
    if(i<LB or i>UB):
        outliers.append(i)
print(outliers)

[18.0]

In [33]:
# Dealing with outliers
upper = np.where(df['marks'] >= UB)

# Lower bound
lower = np.where(df['marks'] <= LB)

df.drop(upper[0], inplace = True)
df.drop(lower[0], inplace = True)

In [34]:
df

   id    name class      marks
0   1   sahil    te  12.000000
1   2   rohan    te  13.000000
2   3  sanket    se  14.000000
3   4   omkar   3rd  14.666667
4   5   vinit    fe  15.000000
5   6    yash    be  16.000000
6   7  aniket   5th  14.666667